'''Задание: Пройдите в цикле по списку ["Вася", "Маша", "Петя", "Валера", "Саша", "Даша"]
   пока не встретите имя "Валера". Когда найдете напишите "Валера нашелся".
   Подсказка: используйте метод list.pop()'''


def find_Valera():
    list_users = ["Вася", "Маша", "Петя", "Валера", "Саша", "Даша"]
    while list_users[0] is not "Валера":
        list_users.pop(0)
    print("Валера, а вот и ты!")
